# Вы можете расположить сценарий своей игры в этом файле.
init python:
    open_eyes = ImageDissolve("eye.png", 2.0, 20, reverse=False)
    closw_eyes = ImageDissolve("eye.png", 2.0, 20, reverse=True)

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:
    scene room_evening with open_eyes

    show Igor with dissolve

    Igor "Сколько я спал?"
    Igor "Чем я занимался вчера?"

    Narrator "Игорь находит чемодан возле кровати"

    Igor "Кажется, я где-то его видел, как будто еще со школы, я носил его каждый день."
    hide Igor

    scene black

    Narrator "Игорь открыл чемодан, в нём лежала огромная сумма денег."

    scene suitcase with fade

    Igor "Я еще сплю? Откуда это? У кого я мог украсть такую сумму денег? Но я всю жизнь был честным…"

    Mind "Уже 19:40. Я ничего не понимаю, но мне пора к друзьям на встречу."


label inroduction:
    scene black with fade

    FullScreen 'На просторах интернета давно не было занимательных историй, которые смогли бы заинтересовать искушенного читателя.'
    FullScreen 'Наверное, и наша команда не сможет этого сделать, но мы постарались.'
    FullScreen 'Для начала увлекательного приключения нужно выбрать персонажа, глазами которого мы расскажем о том, что произошло в городе Н.'

    nvl clear

    jump person_menu


label person_menu:
    scene choose_person with fade

    menu:
        "Выберите судьбу"
        "Вова":
            FullScreen "Постоянно занятый работой, он изредка находит время для посиделок с друзьями."
            FullScreen "В студенчестве он был достаточно амбициозным. Мысли и разговоры о новых проектах занимали большую часть его времени и часто окружающие"
            FullScreen "пророчили ему хорошее будущее в какой-нибудь крупной кампании."

            nvl clear

            menu:
                "Выбрать историю Вовы": 
                    jump choose_vova
                "Назад": 
                    jump person_menu
        "Игорь":
            FullScreen "Молодой парень, который работает в Маке. В целом его жизнь не отличается от жизни миллионов других людей."
            FullScreen "Каждое утро он просыпается, ворчит на свою работу и проводит свой день ровно так же, как проводил тысячи и тысячи дней до этого."
            FullScreen "Он рос совершенно обычным парнем и старался особо ничем не выделяться, ведь именно так его и воспитали."
            
            nvl clear

            menu:
                "Выбрать историю Игоря": 
                    jump club
                "Назад": 
                    jump person_menu
        "Маша":
            FullScreen "Молодая девушка, всерьез увлекающаяся живописью, мечтающая найти себя."
            FullScreen "Живопись она полюбила с детства. И вообще, она чем-то до сих пор похожа на ребенка: наивная, эмоциональная и очень открытая, она часто пленяла своим характером окружающих."
            FullScreen "Маша очень много времени провела в своем родном городе, потому что была очень привязана к матери,"
            FullScreen "но сейчас, ситуация вынудила ее приехать в город Н для того, чтобы заработать денег."
            
            nvl clear

            menu:
                "Выбрать историю Маши": 
                    jump choose_masha
                "Назад": 
                    jump person_menu


label club:
    scene club with fade

    show Masha at left with dissolve
    Masha "Ну что как прошли ваши будние дни?"

    show Vova  reverse at right with dissolve
    Vova "Да как всегда, босс орёт, сижу и делаю эти долбанные отчёты…"
    Vova "Решил да ну его, начну делать стартап."
    Vova "Мы же всегда хотели это сделать братан, помнишь как мы хотели покорять вершины и быть супер богатыми."

    hide Masha

    show Igor at left with dissolve
    Igor "Да…{w} Это было лучшее время…"

    Vova "Но мы можем это сделать сейчас!"
    Vova "Только нам нужны деньги..."
    Vova "Эти чертовы деньги, которых никогда обычно нет! Вот проснуться бы с миллионом под подушкой!"

    Igor "Да…"

    hide Vova

    show Masha reverse at right with dissolve

    Masha "Эх…{w} Я бы тоже хотела миллион."
    Masha "Моя мама лежит сейчас в больнице, одна. Я не знаю что мне делать."
    show Masha cryed reverse at right with dissolve
    Masha "Я боюсь я ее не вылечу…"

    Igor "Эй…{w} Я надеюсь, с ней все будет хорошо…"

    Masha "Я не знаю!"
    Masha "Ей нужны деньги на операцию, а у меня…{w} у меня…"

    hide Igor

    show Vova at left with dissolve
    Vova "Ну успокойся, что ты так реагируешь?!"

    hide Masha

    show Igor at right with dissolve
    Igor "У нее действительно проблема."

    Vova "Не знаю, как у нее, а у меня точно проблемы!"

    hide Vova

    show Masha at left with dissolve
    Masha "Ну что мы все о себе да о себе?!"
    Masha "Игорь, как у тебя дела с девушкой?"

    Igor "Никак...{w} она меня динамит."
    Igor "Она сказала, что я нищеброд и работаю в маке."
    Igor "Но, я думаю, завтра она возьмёт свои слова обратно!"

    hide Masha

    show Vova at left with dissolve
    Vova "О чём ты?"

    hide Igor
    hide Vova
