label choose_masha:

    scene black

    Narrator "Маша сидит и ждёт результата врачей. Напряженность в воздухе означает что-то неладное."

    scene hospital with fade

    show Masha at left with dissolve

    Masha "С ней всё будет хорошо?"

    show Doctor at right with dissolve

    Doctor "Да…"
    Doctor "С ней все будет хорошо не беспокойтесь…"
    Doctor "Но, есть один нюанс..."
    Doctor "Эта операция будет стоить вам миллион, вы готовы ее оплатить?"

    Masha "Что?"
    Masha "А как же обещанные государством деньги?"

    Doctor "Послушайте, у нас очень большая очередь."
    Doctor "Вы понемногу продвигаетесь, но скорее всего мы можем не успеть…"

    hide Doctor
    hide Masha

    Mind "Почему у меня нет денег?.. Я могла бы работать в большом городе и дать все своей матери."
    Mind "А теперь…"
    Mind "теперь я работаю уборщицей на этом гребанном заводе."

    jump club